Repository: ibrahim-s/bookLibrary
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: ar, tr

source: Open Book Library dialog.
ar: فتح محاورةْ مكتبةْ الكتب.
tr: Kitaplık iletişim kutusunu açar.

source: Book Library
ar: مكتبةُ الكتب
tr: Kitaplık

source: Choose language for online books:
ar: اخترْ اللغة للكتب عبر الإنترنت:

source: Name required; You can not leave it blank
ar: إسم الكتاب مطلوب; لا يمكن تركه فارغا
tr: Ad gerekli. Bu alan boş bırakılamaz

source: information
ar: تعليمات
tr: bilgi

source: You can not leave this blank, please enter a url.
ar: لا يمكنك تركه فارغا, فضلا أدخل رابط.
tr: Bağlantı. Bu alan boş bırakılamaz. Lütfen bir bağlantı girin.

source: Information
ar: تعليمات
tr: Bilgi

source: Sort Books By Name
ar: عرض الكتب حسب الاسم
tr: Ada Göre Sırala

source: Sort Books By Author
ar: عرض الكتب حسب المؤلف
tr: Yazara Göre Sırala

source: Sort Books By
ar: ترتيب الكتب حسب
tr: Kitapları Sırala

source: Add A Book
ar: أضِف كتاب
tr: Kitap Ekle

source: Edit Selected
ar: تعديل الكتاب المحدد
tr: Seçileni Düzenle

source: Remove Selected
ar: إزالةْ الكتاب
tr: Seçileni Kaldır

source: Move Book To
ar: نقل الكتاب إلى
tr: Kitabı Şuraya Taşı

source: Remove All
ar: إزالةْ جميع الكتب
tr: Tümünü kaldır

source: EnterBook Name Please
ar: أَدخِلْ اسم الكتاب فضلا
tr: Lütfen Kitap Adını Girin

source: Book Name
ar: إسم الكتاب
tr: Kitap Adı

source: Enter Author Name
ar: أَدخِلْ إسم المؤلف فضلا
tr: Lütfen Yazar Adını Girin

source: Author name
ar: إسم المؤلف
tr: Yazar adı

source: This book already exist in library, please enter a new one or remove existed first
ar: هذا الكتاب موجود بالفعل في المكتبة، يرجى إدخال كتاب جديد أو إزالة الكتاب الموجود أولاً
tr: Bu kitap zaten mevcut. Lütfen farklı bir tane girin veya önce var olanı kaldırın

source: Warning
ar: تحذير
tr: Uyarı

source: Write Something About The Book
ar: أَدخِلْ شيئا عن الكتاب
tr: Kitap Hakkında Bir Şey Yazın

source: About
ar: حول الكتاب
tr: Hakkında

source: Enter Size of Book or file
ar: أدخل حجم الكتاب أو الملف
tr: Kitabın veya Dosyanın Boyutunu Girin

source: size
ar: الحجم
tr: boyut

source: Enter Url source to access book(www...)
ar: أدخل رابط للوصول إلى الكتاب (www...)
tr: Kitaba erişebilmek için kaynak bağlantıyı girin(www...)

source: Url:
ar: الرابط:
tr: Bağlantı:

source: Enter other urls for the book if present, or leave blank
ar: أدخِلْ روابط أخرى للكتاب إن وُجدت, أو اتركه فارغا
tr: Varsa, kitap için diğer bağlantıları girin veya boş bırakın

source: Othr urls:
ar: روابط أُخرى:
tr: Diğer Bağlantılar:

source: Are you sure you want to remove {} by {}?, this can not be undone.
ar: هل أنت متأكد من أنك تريد حذف كتاب {} لصاحبه {}?, هذا الإجراء لا يمكن التراجع عنه.
tr: {} öğesini {} ile kaldırmak istediğinizden emin misiniz? bu işlem geri alınamaz.

source: This book is already present in {library} library, under {label} label; Do you still want to replace it with the one you are about to move?.
ar: هذا الكتاب موجود بالفعل في مكتبة {library}، تحت التصنيف {label}؛ هل مازلت تريد استبداله بالذي أنت على وشك نقله؟.
tr: Bu kitap zaten {library} kitaplığında {label} etiketi altında mevcut; Hâlâ taşımak üzere olduğunuz kitapla değiştirmek istiyor musunuz?.

source: Unable to move the book to another library
ar: ليس بالإمكان نقل الكتاب إلى مكتبة أخرى
tr: Kitap başka bir kitaplığa taşınamıyor

source: Error
ar: خَطَأ
tr: Hata

source: Are you sure you want to remove all books from this library?, this can not be undone.
ar: هل أنت متأكد من أنك تريد حذف جميع الكتب في هذه المكتبة؟ هذا الإجراء لا يمكن التراجع عنه.
tr: Bu kitaplıktaki tüm kitapları kaldırmak istediğinizden emin misiniz? bu işlem geri alınamaz.

source: About The Book
ar: حول الكتاب
tr: Kitap Hakkında

source: Size of Book:
ar: حجم الكتاب:
tr: Kitabın Boyutu:

source: Book Url:
ar: رابط الكتاب:
tr: Kitabın Bağlantısı:

source: Other Urls for the book:
ar: روابط أخرى للكتاب:
tr: Kitabın diğer Bağlantıları:

source: Access book
ar: الوصول للكتاب
tr: Kitabı Aç

source: Close
ar: إغلاق

source: by
ar: تأليف
tr: yazar

source: in
ar: في
tr: içinde

source: Unable to load books data
ar: ليس بالإمكان الحصول على بيانات الكتب
tr: Kitap verileri yüklenemiyor

source: This name is already present for another library, enter another name please
ar: هذا الاسم موجود بالفعل لمكتبة أخرى، أدخل اسم آخر من فضلك
tr: Bu ad ile bir kitaplık zaten mevcut. Lütfen farklı bir ad girin

source: Audio Library
ar: المكتبة الصوتية
tr: Ses Kitaplığı

source: Library:
ar: المكتبة:
tr: Kitaplık:

source: Access the book:
ar: الوصول للكتاب:
tr: Kitaba erişin:

source: Other links for the book:
ar: روابط أخرى للكتاب:
tr: Kitabın diğer bağlantıları:

source: About the book:
ar: حول الكتاب:
tr: Kitap hakkında:

source: Json File
ar: ملف بصيغةْ json
tr: Json Dosyası

source: Html File
ar: ملف بصيغةْ html
tr: Html Dosyası

source: Export Library As
ar: تصدير المكتبة بصيغة
tr: Kitaplığı Dışa Aktar

source: Import Library(as Json)
ar: استيراد مكتبة(بصيغة json)
tr: Kitaplığı İçe Aktar (Json olarak)

source: Failed to export library
ar: لم ننجح بتصدير المكتبة
tr: Kitaplık dışa aktarılamadı

source: Information: Library Exported
ar: تعليمات: لقد تم تصدير المكتبة
tr: Bilgi: Kitaplık Dışa Aktarıldı

source: Failed to open library, or may be library file is not valid.
ar: لم ننجح في فتح المكتبة, و ربما يكون ملف المكتبة غير صالح.
tr: Kitaplık açılamadı. Kitaplık dosyası geçerli olmayabilir.

source: Importfailed; chosen file seems not valid.
ar: فشِل الاستيراد؛ الملف المختار يبدو غير صالح.
tr: İçe aktarma başarısız; seçilen dosya geçerli görünmüyor.

source: Import Error
ar: خَطَأ استيراد
tr: İçe Aktarma Hatası

source: Sorry, importing of library failed
ar: عذرًا، تمَّ الفشل استيراد المكتبة
tr: Üzgünüz, Kitaplık içe aktarılamadı

source: Information: Library imported.
ar: تعليمات: تمَّ استيراد المكتبة.
tr: Bilgi: Kitaplık içe aktarıldı.

source: A library with similar name already exists, do you want to merge the two libraries?
ar: توجد مكتبة بنفس الاسم بالفعل، هل تريد دمج المكتبتين؟
tr: Benzer isimde bir Kitaplık zaten mevcut. İki Kitaplığı birleştirmek ister misiniz?

source: Online Libraries
ar: مكتبات على الإنترنت

source: Local Libraries
ar: مكتبات محلِيَّة

source: Add local library
ar: أضِف مكتبة محلِيَّة

source: Rename library
ar: إعادة تسميةْ المكتبة

source: Remove library
ar: إزالةْ المكتبة

source: Information:Failed to create directory.
ar: تعليمات: فشلنا في إنشاء مسار.
tr: Bilgi: Dizin oluşturulamadı.

source: Enter library name please
ar: أدخل اسم المكتبة من فضلك
tr: Lütfen Kitaplık adını girin

source: Add Library
ar: أضِف مكتبة
tr: Kitaplık Ekle

source: Enter new name please
ar: أدخل الاسم الجديد من فضلك
tr: Lütfen yeni bir ad girin

source: rename
ar: إعادةْ التسمية
tr: yeniden Adlandır

source: Are you sure you want to remove {} library, this can not be undone?
ar: هل أنت متأكد أنك تريد إزالة مكتبة {}، فهذا الإجراء لا يمكن التراجع عنه؟
tr: {} kitaplığını kaldırmak istediğinizden emin misiniz, bu işlem geri alınamaz?

source: A library dialog is already opened; Close it first please.
ar: هناك محاورة لمكتبة أخرى مفتوحة; أغلقها أولاً لو سمحت.
tr: Kitaplık iletişim kutusu zaten açık. Lütfen önce açık olanı kapatın.

source: This is an addon to arrange your downloadable or online books. from the main dialog, you choose the library or category of books. You can add, rename or remove any library in this dialog at any time. and on the library dialog you can access the about, size, url, other urls if present of a book. moreover with context menu on list of books you can add, edit, remove, remove all, and sort book by author or name. you can open the main dialog of libraries with the shortcut: nvda+control+windows+b And as always you can change this command via: nvda menu> preferences>input gestures> book library.
ar: هذه ئإضافة لتنظيم روابط الكتب التي ترغب بها من على الإنترنت مِن مربع الحوار الرئيسي، يمكنك اختيار المكتبة أو فئة الكتب التي تريد. يمكنك إضافة أو إعادة تسمية أو إزالة أي مكتبة في مربع الحوار هذا في أي وقت. و من على محاورةْ المكتبة التي ستظهر, يمكنك معرفةْ لمحة عن الكتاب, الحجم, رابط التحميل و روابط أُخرى إنْ وُجدت. و زيادة على ذلك,بالوقوف على قائمةْ الكتب و باستعمال مفتاح التطبيقات, يمكنك إضافةْ, تعديل, إزالةْ الكتاب المحدد أو الكل, كما بلإمكان تنظيم الكتب حسب اسم الكتاب أو المؤلف. تستطيع فتح المحاورة الرئيسية للإضافة بالضغط على الإختصار: nvda+control+windows+B. و تستطيع دائما تغيير هذا الإختصار بالذهاب إلى: قاءمةْ NVDA ثم تفضيلات ثم تخصيص إختصارات NVDA ثم مكتبةْ الكتب.
tr: Bu, indirilebilir veya çevrimiçi kitaplarınızı düzenlemek için bir eklentidir. ana iletişim kutusundan kitaplığı veya kitap kategorisini seçersiniz. Bu iletişim kutusundaki herhangi bir kitaplığı istediğiniz zaman yeniden adlandırabilir, kaldırabilir ve yeni bir kitaplık ekleyebilirsiniz. Kitaplık iletişim kutusunda bir kitabın hakkında, boyutu, Bağlantısı ve varsa diğer bağlantılarına erişebilirsiniz. Üstelik kitap listesindeki içerik menüsüyle ekleyebilir, düzenleyebilir, kaldırabilir, tümünü kaldırabilir ve kitapları yazara veya ada göre sıralayabilirsiniz. Kitaplık ana iletişim kutusunu şu kısayolla açabilirsiniz: nvda+control+windows+b Ve her zaman olduğu gibi bu komutu şu şekilde değiştirebilirsiniz: nvda menüsü> tercihler>girdi hareketleri>kitaplık.

source: Cancel
tr: İptal

source: Choose a library
tr: Bir Kitaplık seçin

source: Add
tr: Ekle

source: Rename
tr: Yeniden Adlandır

source: Remove
tr: Kaldır

source: OK
tr: Tamam
